GTUEngineers/autonomous-vehicle-mcu/STM32_Codes/autonomousVehicle_GTU/Src/main.c
        if (communication_get_msg(&req) == OK)
        {
            msg_header = (req.req.msg[0] & 0b11110000) >> 4;
            switch (msg_header)
            {
                case 0x0:
                {
                    uint8_t val = 0;

                    parse_startstop_msg(&req, &val);

                    if (val == 1)
                    {
                        if (HAL_GPIO_ReadPin(EMERGENCY_STOP_GPIO_Port, EMERGENCY_STOP_Pin)
                                == GPIO_PIN_SET)
                        {
                            start_system( );
                            ret_val = 1;
                        }

                    }
                    else if (val == 0)
                    {
                        emergency_stop( );
                    }

                    break;
                }
                case 0x1:
                {
                    if (is_started == 1)
                    {
                        uint8_t dir;
                        int16_t val;
                        parse_steer_msg(&req, &dir, &val);
                        if (dir == 0)
                        {
                            val = val * 7;
                        }
                        else
                        {
                            val = val * 7 * -1;
                        }
                        steer_set_value(val);
                        ret_val = 1;
                    }
                    else
                    {
                        ret_val = 0;
                    }
                    break;
                }
                case 0x2:
                {
                    if (is_started == 1)
                    {
                        uint8_t val;
                        parse_throttle_msg(&req, &val);
                        switch (val)
                        {
                            case 0:
                            {
                                throttle_set_value(SPEED_0);
                                break;
                            }
                            case 5:
                            {
                                throttle_set_value(SPEED_5);
                                break;
                            }
                            case 8:
                            {
                                throttle_set_value(SPEED_8);
                                break;
                            }
                            case 10:
                            {
                                throttle_set_value(SPEED_10);
                                break;
                            }
                            case 13:
                            {
                                throttle_set_value(SPEED_13);
                                break;
                            }
                            case 15:
                            {
                                throttle_set_value(SPEED_15);
                                break;
                            }
                            case 20:
                            {
                                throttle_set_value(SPEED_20);
                                break;
                            }
                            default:
                            {

                                throttle_set_value(SPEED_0);
                                break;
                            }

                        }
                        ret_val = 1;
                    }
                    else
                    {
                        ret_val = 0;
                    }
                    break;
                }
                case 0x3:
                {
                    if (is_started == 1)
                    {
                        uint8_t val;
                        parse_brake_msg(&req, &val);
                        if (val == 0)
                        {
                            brake_set_value(BRAKE_RELEASE);
                        }
                        else
                        {
                            brake_set_value(BRAKE_LOCK);
                        }
                        ret_val = 1;
                    }
                    else
                    {
                        ret_val = 0;
                    }
                    break;
                }
                case 0x4:
                {
                    ret_val = is_started;
                    break;
                }
                default:
                {
                    //LOGGER
                    break;
                }
            }

        }
        else
        {
        }
        create_general_rep_msg(&rep, ret_val);
        communication_send_msg(&rep);

    }
    /* USER CODE END ControlTask */
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler (void)
{
    /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */

    /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
